{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 106], "dtype": "int32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 106], "dtype": "float32", "input_dim": 5675, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": 0, "maxval": 6.283185307179586, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 106}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, 106], "dtype": "float32", "input_dim": 5675, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": {"class_name": "UnitNorm", "config": {"axis": 1}}, "mask_zero": false, "input_length": 106}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "complex_multiply_1", "class_name": "ComplexMultiply", "config": {"name": "complex_multiply_1", "trainable": true}, "inbound_nodes": [[["embedding_1", 0, 0, {}], ["embedding_2", 0, 0, {}]]]}, {"name": "complex_superposition_1", "class_name": "ComplexSuperposition", "config": {"name": "complex_superposition_1", "trainable": true}, "inbound_nodes": [[["complex_multiply_1", 0, 0, {}], ["complex_multiply_1", 0, 1, {}]]]}, {"name": "complex_dense_1", "class_name": "ComplexDense", "config": {"name": "complex_dense_1", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "init_criterion": "he", "kernel_initializer": "complex", "bias_initializer": {"class_name": "Constant", "config": {"value": -1}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "seed": 124732}, "inbound_nodes": [[["complex_superposition_1", 0, 0, {}], ["complex_superposition_1", 0, 1, {}]]]}, {"name": "get_real_1", "class_name": "GetReal", "config": {"name": "get_real_1", "trainable": false}, "inbound_nodes": [[["complex_dense_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["get_real_1", 0, 0]]}, "keras_version": "2.1.4", "backend": "tensorflow"}